bench.txt
# FastAPI
Running 10s test @ http://127.0.0.1:8000/hello/joe
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.79ms   11.24ms 278.02ms   92.65%
    Req/Sec   775.32     84.52     0.95k    74.00%
  30897 requests in 10.02s, 4.07MB read
Requests/sec:   3082.45
Transfer/sec:    415.41KB

# Sanic
Running 10s test @ http://127.0.0.1:3000/hello/joe
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.51ms    1.33ms  34.04ms   75.90%
    Req/Sec    10.02k     0.86k   13.37k    69.50%
  399109 requests in 10.01s, 42.63MB read
Requests/sec:  39853.23
Transfer/sec:      4.26MB

# OxAPY
Running 10s test @ http://127.0.0.1:5555/hello/joe
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.90ms  467.38us   5.66ms   74.86%
    Req/Sec    26.01k     1.66k   30.77k    70.00%
  1035287 requests in 10.01s, 111.57MB read
Requests/sec: 103398.34
Transfer/sec:     11.14MB

# Gostdlib
Running 10s test @ http://127.0.0.1:5555/hello/joe
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.17ms    1.22ms  15.77ms   85.17%
    Req/Sec    24.18k     2.75k   31.70k    70.25%
  965621 requests in 10.05s, 117.87MB read
Requests/sec:  96106.66
Transfer/sec:     11.73MB